
## Plan Result (aat)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_workspace_id
* Update
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_workspace_id will be created
  + resource "azurerm_key_vault_secret" "app_insights_workspace_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "app-insights-workspace-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.Insights/components/et-aat"
        name                                  = "et-aat"
      ~ sampling_percentage                   = 100 -> 1
        tags                                  = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":130,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->